Белгипрозем_2017/src/DataProcessors/мИзменениеПодразделенияЭтапаПоИсполнителю/мИзменениеПодразделенияЭтапаПоИсполнителю.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>мИзменениеПодразделенияЭтапаПоИсполнителю</name>
</mdclass:DataProcessor>

Белгипрозем_2017/src/InformationRegisters/СведенияОПользователях/СведенияОПользователях.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СведенияОПользователях</name>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </resources>
  <resources>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </resources>
  <resources>
    <name>Ранг</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Белгипрозем_2017/src/Documents/мАктирование/мАктирование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>мАктирование</name>
  <registerRecords>AccumulationRegister.Сметы</registerRecords>
  <registerRecords>AccumulationRegister.УчетПроизводство</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиПроизводство</registerRecords>
  <registerRecords>AccumulationRegister.НачислениеЗП</registerRecords>
  <registerRecords>AccumulationRegister.УчетДоговоров</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПокупателями</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Зарплата</name>
    <attributes>
      <name>ЭтапДоговора</name>
      <type>
        <types>CatalogRef.мЭтапыДоговоров</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>КТУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Норматив</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <comment>Коэффициент понижающий или повышающий</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемРабот</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Начислено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбоснованиеКоэффициента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерАкта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НеОсновноеПодразделение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>БазовоеНачисление</name>
      <comment>Сумма сделки без учета +/- коэф.</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРабот</name>
      <type>
        <types>CatalogRef.мОбъектыРабот</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Акты</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ВнутренниеДокументы</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтапДоговора</name>
      <type>
        <types>CatalogRef.мЭтапыДоговоров</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерАкта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаАкта</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПрочих</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Акт</name>
      <type>
        <types>CatalogRef.ВнутренниеДокументы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОбъектыРабот</name>
    <attributes>
      <name>ЭтапДоговора</name>
      <type>
        <types>CatalogRef.мЭтапыДоговоров</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРабот</name>
      <type>
        <types>CatalogRef.мОбъектыРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПрочих</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаЗИС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Белгипрозем_2017/src/DataProcessors/мИзменениеПодразделенияЭтапаПоИсполнителю/Forms/Форма/Module.bsl
&НаСервере
Процедура ИзменитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	мЭтапыДоговоров.Ссылка КАК ЭтапДоговора,
		|	мЭтапыДоговоров.Владелец КАК Владелец,
		|	мЭтапыДоговоров.Подразделение КАК Подразделение
		|ПОМЕСТИТЬ Этапы
		|ИЗ
		|	Документ.мАктирование.Акты КАК мАктированиеАкты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.мЭтапыДоговоров КАК мЭтапыДоговоров
		|		ПО мАктированиеАкты.ЭтапДоговора = мЭтапыДоговоров.Ссылка
		|ГДЕ
		|	мАктированиеАкты.Ссылка.Дата >= &ДатаРегистрации
		|	И мЭтапыДоговоров.Подразделение.Родитель = &Родитель
		|	И мЭтапыДоговоров.Подразделение = &Подразделение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	мЭтапыДоговоровИсполнители.Исполнитель КАК Исполнитель,
		|	мЭтапыДоговоровИсполнители.Ссылка КАК ЭтапДоговора
		|ПОМЕСТИТЬ Исполнители
		|ИЗ
		|	Справочник.мЭтапыДоговоров.Исполнители КАК мЭтапыДоговоровИсполнители
		|ГДЕ
		|	мЭтапыДоговоровИсполнители.Ссылка В
		|			(ВЫБРАТЬ
		|				Этапы.ЭтапДоговора
		|			ИЗ
		|				Этапы КАК Этапы)
		|	И мЭтапыДоговоровИсполнители.НомерСтроки = 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СведенияОПользователях.Подразделение КАК Подразделение,
		|	Этапы.ЭтапДоговора,
		|	Этапы.Подразделение КАК Подразделение1,
		|	Исполнители.Исполнитель,
		|	Этапы.Владелец.Представление КАК Договор
		|ИЗ
		|	Этапы КАК Этапы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Исполнители КАК Исполнители
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СведенияОПользователях КАК СведенияОПользователях
		|			ПО Исполнители.Исполнитель = СведенияОПользователях.Пользователь
		|		ПО (Исполнители.ЭтапДоговора = Этапы.ЭтапДоговора)";
	
	Запрос.УстановитьПараметр("ДатаРегистрации", ДатаРегистрации);
	
	Если ЗначениеЗаполнено(Подразделение) Тогда
		Запрос.УстановитьПараметр("Подразделение", Подразделение);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И мЭтапыДоговоров.Подразделение.Родитель = &Родитель", "");
	Иначе
		Запрос.УстановитьПараметр("Родитель", Справочники.СтруктураПредприятия.ПустаяСсылка());
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И мЭтапыДоговоров.Подразделение = &Подразделение", "");
	КонецЕсли; 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Не ЗначениеЗаполнено(Выборка.Подразделение) Тогда
			Продолжить;
		КонецЕсли; 
		Этап = Выборка.ЭтапДоговора.ПолучитьОбъект();
		Этап.Подразделение = Выборка.Подразделение;
		Этап.Записать();
		Сообщить("Изменен "+Выборка.Договор + " " + Выборка.ЭтапДоговора);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Изменить(Команда)
	ИзменитьНаСервере();
КонецПроцедуры
